goplus/llgo/targets/device/nrf/nrf5340_network.s
// Automatically generated file. DO NOT EDIT.
// Generated by gen-device-svd.go from nrf5340_network.svd, see https://github.com/NordicSemiconductor/nrfx/tree/master/mdk

/*
// nRF53 reference description for system-on-chip with dual ARM 32-bit Cortex-M33 microcontrollers
*/

//     Copyright (c) 2010 - 2020, Nordic Semiconductor ASA All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. Neither the name of Nordic Semiconductor ASA nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

.syntax unified

// This is the default handler for interrupts, if triggered but not defined.
.section .text.Default_Handler
.global  Default_Handler
.type    Default_Handler, %function
Default_Handler:
    wfe
    b    Default_Handler
.size Default_Handler, .-Default_Handler

// Avoid the need for repeated .weak and .set instructions.
.macro IRQ handler
    .weak  \handler
    .set   \handler, Default_Handler
.endm

// Must set the "a" flag on the section:
// https://svnweb.freebsd.org/base/stable/11/sys/arm/arm/locore-v4.S?r1=321049&r2=321048&pathrev=321049
// https://sourceware.org/binutils/docs/as/Section.html#ELF-Version
.section .isr_vector, "a", %progbits
.global  __isr_vector
__isr_vector:
    // Interrupt vector as defined by Cortex-M, starting with the stack top.
    // On reset, SP is initialized with *0x0 and PC is loaded with *0x4, loading
    // _stack_top and Reset_Handler.
    .long _stack_top
    .long Reset_Handler
    .long NMI_Handler
    .long HardFault_Handler
    .long MemoryManagement_Handler
    .long BusFault_Handler
    .long UsageFault_Handler
    .long 0
    .long 0
    .long 0
    .long 0
    .long SVC_Handler
    .long DebugMon_Handler
    .long 0
    .long PendSV_Handler
    .long SysTick_Handler

    // Extra interrupts for peripherals defined by the hardware vendor.
    .long 0
    .long 0
    .long 0
    .long 0
    .long 0
    .long CLOCK_POWER_IRQHandler
    .long 0
    .long 0
    .long RADIO_IRQHandler
    .long RNG_IRQHandler
    .long GPIOTE_IRQHandler
    .long WDT_IRQHandler
    .long TIMER0_IRQHandler
    .long ECB_IRQHandler
    .long AAR_CCM_IRQHandler
    .long 0
    .long TEMP_IRQHandler
    .long RTC0_IRQHandler
    .long IPC_IRQHandler
    .long SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQHandler
    .long EGU0_IRQHandler
    .long 0
    .long RTC1_IRQHandler
    .long 0
    .long TIMER1_IRQHandler
    .long TIMER2_IRQHandler
    .long SWI0_IRQHandler
    .long SWI1_IRQHandler
    .long SWI2_IRQHandler
    .long SWI3_IRQHandler

    // Define default implementations for interrupts, redirecting to
    // Default_Handler when not implemented.
    IRQ NMI_Handler
    IRQ HardFault_Handler
    IRQ MemoryManagement_Handler
    IRQ BusFault_Handler
    IRQ UsageFault_Handler
    IRQ SVC_Handler
    IRQ DebugMon_Handler
    IRQ PendSV_Handler
    IRQ SysTick_Handler
    IRQ CLOCK_POWER_IRQHandler
    IRQ CLOCK_NS_IRQHandler
    IRQ POWER_NS_IRQHandler
    IRQ RADIO_IRQHandler
    IRQ RADIO_NS_IRQHandler
    IRQ RNG_IRQHandler
    IRQ RNG_NS_IRQHandler
    IRQ GPIOTE_IRQHandler
    IRQ GPIOTE_NS_IRQHandler
    IRQ WDT_IRQHandler
    IRQ WDT_NS_IRQHandler
    IRQ TIMER0_IRQHandler
    IRQ TIMER0_NS_IRQHandler
    IRQ ECB_IRQHandler
    IRQ ECB_NS_IRQHandler
    IRQ AAR_CCM_IRQHandler
    IRQ AAR_NS_IRQHandler
    IRQ CCM_NS_IRQHandler
    IRQ TEMP_IRQHandler
    IRQ TEMP_NS_IRQHandler
    IRQ RTC0_IRQHandler
    IRQ RTC0_NS_IRQHandler
    IRQ IPC_IRQHandler
    IRQ IPC_NS_IRQHandler
    IRQ SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQHandler
    IRQ SPIM0_NS_IRQHandler
    IRQ SPIS0_NS_IRQHandler
    IRQ TWIM0_NS_IRQHandler
    IRQ TWIS0_NS_IRQHandler
    IRQ UARTE0_NS_IRQHandler
    IRQ EGU0_IRQHandler
    IRQ EGU0_NS_IRQHandler
    IRQ RTC1_IRQHandler
    IRQ RTC1_NS_IRQHandler
    IRQ TIMER1_IRQHandler
    IRQ TIMER1_NS_IRQHandler
    IRQ TIMER2_IRQHandler
    IRQ TIMER2_NS_IRQHandler
    IRQ SWI0_IRQHandler
    IRQ SWI0_NS_IRQHandler
    IRQ SWI1_IRQHandler
    IRQ SWI1_NS_IRQHandler
    IRQ SWI2_IRQHandler
    IRQ SWI2_NS_IRQHandler
    IRQ SWI3_IRQHandler
    IRQ SWI3_NS_IRQHandler

.size __isr_vector, .-__isr_vector
